Revit 2027 API
RebarFreeFormAccessor.IsValidRebarTargetForMorphedRebar Method
 Checks if the rebar can be used as a target for morphed rebar. A rebar is a valid target for morphed rebar if all the bars in set have the same number of segments and all are planar. Multiplanar bars are considered invalid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidRebarTargetForMorphedRebar(
	Rebar rebarTarget
)
Public Shared Function IsValidRebarTargetForMorphedRebar (
	rebarTarget As Rebar
) As Boolean
public:
static bool IsValidRebarTargetForMorphedRebar(
	Rebar^ rebarTarget
)
static member IsValidRebarTargetForMorphedRebar :
        rebarTarget : Rebar -> bool
Parameters
rebarTarget Rebar
 The rebar that will be tested.
Return Value
Boolean
 Return true if the rebar is a valid target for morphed rebar, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace